DanAla/ESP32-S3_EasyConnect/src/ESP32-S3_EasyConnect.cpp
#include "ESP32S3_EasyConnect.h"
#include <stdarg.h>

ESP32S3_EasyConnect EasyConnect;

ESP32S3_EasyConnect::ESP32S3_EasyConnect() 
  : server(80),
    webSocket(81),
    telnetServer(23) {
  // Initialize with default values
  config.deviceName = "ESP32-S3-Device";
  config.theme = "dark";
  config.enableOTA = true;
  config.enableTelnet = true;
  config.telnetPort = 23;
  config.updateInterval = 5000;
  config.customParam1 = "";
  config.customParam2 = "";
  config.customParam3 = 0;
  config.customParam4 = 0.0;
  
  // Initialize telnet clients
  for (int i = 0; i < MAX_TELNET_CLIENTS; i++) {
    telnetClients[i].connected = false;
    telnetClients[i].lastActivity = 0;
  }
}

bool ESP32S3_EasyConnect::begin(const char* deviceName) {
  Serial.begin(115200);
  
  // Initial startup message to Serial only (Telnet not ready yet)
  Serial.println("\n");
  Serial.println("🚀 Starting ESP32-S3 EasyConnect Framework v1.2.0");
  Serial.println("📡 With Telnet server and WebSocket support!");
  Serial.println("==============================================");
  
  // Initialize filesystem
  if (!LittleFS.begin(true)) {
    Serial.println("❌ LittleFS Mount Failed");
    return false;
  }
  
  // Load configuration
  if (!loadConfig()) {
    Serial.println("⚠️ Using default configuration");
  }
  
  // Set device name if provided
  if (deviceName != nullptr) {
    config.deviceName = deviceName;
  }
  
  // WiFiManager setup
  wifiManager.setTimeout(180);
  wifiManager.setConfigPortalTimeout(180);
  wifiManager.setAPCallback([](WiFiManager* mgr) {
    Serial.println("📱 Entered Configuration Mode");
    Serial.print("IP Address: ");
    Serial.println(WiFi.softAPIP());
  });
  
  // Custom parameters in WiFiManager
  WiFiManagerParameter custom_deviceName("name", "Device Name", config.deviceName.c_str(), 40);
  WiFiManagerParameter custom_theme("theme", "Theme (light/dark)", config.theme.c_str(), 10);
  WiFiManagerParameter custom_telnet("telnet", "Enable Telnet (0/1)", config.enableTelnet ? "1" : "0", 2);
  
  wifiManager.addParameter(&custom_deviceName);
  wifiManager.addParameter(&custom_theme);
  wifiManager.addParameter(&custom_telnet);
  
  // Attempt to connect to saved network or start configuration portal
  bool res = wifiManager.autoConnect(config.deviceName.c_str());
  
  if (!res) {
    logln("❌ Failed to connect and hit timeout");
    delay(3000);
    ESP.restart();
  } else {
    logln("✅ WiFi Connected!");
    log("IP Address: ");
    logln(WiFi.localIP().toString());
    isConnected = true;
    
    if (onConnectedCallback != nullptr) {
      onConnectedCallback();
    }
  }
  
  // Update config with WiFiManager parameters
  config.deviceName = custom_deviceName.getValue();
  config.theme = custom_theme.getValue();
  config.enableTelnet = (String(custom_telnet.getValue()) == "1");
  saveConfig();
  
  // Setup telnet server if enabled
  if (config.enableTelnet) {
    setupTelnet();
  }
  
  // Setup web server and WebSocket
  setupWebServer();
  setupWebSocket();
  
  // Setup ElegantOTA
  if (config.enableOTA) {
    ElegantOTA.begin(&server, otaUsername, otaPassword);
    logln("✅ OTA Updates enabled at /update");
  }
  
  server.begin();
  logln("✅ HTTP server started on port 80");
  logln("✅ WebSocket server started on port 81");
  
  deviceUptime = millis();
  return true;
}

void ESP32S3_EasyConnect::loop() {
  server.handleClient();
  webSocket.loop();
  ElegantOTA.loop();
  
  // Update uptime
  deviceUptime = millis();
  
  // Handle Telnet connections and data
  if (config.enableTelnet) {
    handleTelnet();
  }
  
  // Handle WiFi reconnection
  if (WiFi.status() != WL_CONNECTED) {
    if (isConnected) {
      isConnected = false;
      logln("❌ WiFi disconnected");
      if (onDisconnectedCallback != nullptr) {
        onDisconnectedCallback();
      }
    }
    
    if (millis() - lastReconnectAttempt > 10000) {
      logln("🔄 Attempting WiFi reconnection...");
      WiFi.reconnect();
      lastReconnectAttempt = millis();
    }
  } else if (!isConnected) {
    isConnected = true;
    logln("✅ WiFi reconnected");
    if (onConnectedCallback != nullptr) {
      onConnectedCallback();
    }
  }
  
  // Send periodic updates via WebSocket
  if (millis() - lastUpdate > config.updateInterval) {
    sendDeviceStatus();
    lastUpdate = millis();
  }
}

void ESP32S3_EasyConnect::setupTelnet() {
  telnetServer.begin();
  telnetServer.setNoDelay(true);
  telnetEnabled = true;
  
  log("✅ Telnet server started on port ");
  logln(String(config.telnetPort));
  logln("💡 Connect using: telnet " + WiFi.localIP().toString());
}

void ESP32S3_EasyConnect::handleTelnet() {
  // Check for new connections
  if (telnetServer.hasClient()) {
    bool connectionAccepted = false;
    
    for (int i = 0; i < MAX_TELNET_CLIENTS; i++) {
      if (!telnetClients[i].connected) {
        if (telnetClients[i].client) {
          telnetClients[i].client.stop();
        }
        
        telnetClients[i].client = telnetServer.available();
        telnetClients[i].connected = true;
        telnetClients[i].lastActivity = millis();
        
        // Send welcome message
        String welcome = "\r\n";
        welcome += "┌────────────────────────────────────────┐\r\n";
        welcome += "│       ESP32-S3 EasyConnect Telnet     │\r\n";
        welcome += "│              Framework v1.2.0         │\r\n";
        welcome += "└────────────────────────────────────────┘\r\n";
        welcome += "Device: " + config.deviceName + "\r\n";
        welcome += "IP: " + WiFi.localIP().toString() + "\r\n";
        welcome += "Free Heap: " + String(ESP.getFreeHeap()) + " bytes\r\n";
        welcome += "Uptime: " + String(deviceUptime / 1000) + "s\r\n";
        welcome += "Connected clients: " + String(getTelnetClientCount()) + "/" + String(MAX_TELNET_CLIENTS) + "\r\n";
        welcome += "Type 'help' for available commands\r\n";
        welcome += "----------------------------------------\r\n";
        welcome += "> ";
        
        telnetClients[i].client.print(welcome);
        connectionAccepted = true;
        
        log("🔌 Telnet client connected from: ");
        logln(telnetClients[i].client.remoteIP().toString());
        break;
      }
    }
    
