DanAla/ESP32-S3_EasyConnect/src/ESP32-S3_EasyConnect.cpp
    if (!connectionAccepted) {
      // No free slots, reject connection
      WiFiClient client = telnetServer.available();
      client.print("❌ Maximum telnet clients reached (" + String(MAX_TELNET_CLIENTS) + "). Try again later.\r\n");
      client.stop();
      logln("⚠️ Telnet connection rejected - maximum clients reached");
    }
  }
  
  // Handle data from connected clients
  for (int i = 0; i < MAX_TELNET_CLIENTS; i++) {
    if (telnetClients[i].connected && telnetClients[i].client.connected()) {
      // Check for incoming data
      while (telnetClients[i].client.available()) {
        String command = telnetClients[i].client.readStringUntil('\n');
        command.trim();
        
        if (command.length() > 0) {
          telnetClients[i].lastActivity = millis();
          
          log("📨 Telnet command from ");
          log(telnetClients[i].client.remoteIP().toString());
          log(": ");
          logln(command);
          
          // Handle built-in commands
          if (command == "help" || command == "?") {
            String help = "Available commands:\r\n";
            help += "  help, ?       - Show this help\r\n";
            help += "  status        - Show device status\r\n";
            help += "  restart       - Restart device\r\n";
            help += "  factoryreset  - Factory reset\r\n";
            help += "  clients       - Show connected clients\r\n";
            help += "  wifi          - Show WiFi info\r\n";
            help += "  memory        - Show memory usage\r\n";
            help += "  config        - Show current configuration\r\n";
            help += "  clear, cls    - Clear screen\r\n";
            help += "  disconnect    - Disconnect this session\r\n";
            help += "Custom commands can be added via callback\r\n";
            help += "> ";
            telnetClients[i].client.print(help);
            
          } else if (command == "status") {
            String status = "Device Status:\r\n";
            status += "  Name: " + config.deviceName + "\r\n";
            status += "  Uptime: " + String(deviceUptime / 1000) + "s\r\n";
            status += "  Free Heap: " + String(ESP.getFreeHeap()) + " bytes\r\n";
            status += "  WiFi: " + String(WiFi.SSID()) + " (" + String(WiFi.RSSI()) + " dBm)\r\n";
            status += "  IP: " + WiFi.localIP().toString() + "\r\n";
            status += "  Telnet clients: " + String(getTelnetClientCount()) + "/" + String(MAX_TELNET_CLIENTS) + "\r\n";
            status += "> ";
            telnetClients[i].client.print(status);
            
          } else if (command == "restart") {
            telnetClients[i].client.print("🔄 Restarting device...\r\n");
            delay(1000);
            restartDevice();
            
          } else if (command == "factoryreset") {
            telnetClients[i].client.print("🗑️ Factory reset...\r\n");
            delay(1000);
            factoryReset();
            
          } else if (command == "clients") {
            String clients = "Connected Telnet Clients:\r\n";
            for (int j = 0; j < MAX_TELNET_CLIENTS; j++) {
              if (telnetClients[j].connected && telnetClients[j].client.connected()) {
                clients += "  " + String(j+1) + ". " + telnetClients[j].client.remoteIP().toString() + 
                          " (active " + String((millis() - telnetClients[j].lastActivity) / 1000) + "s ago)\r\n";
              }
            }
            clients += "> ";
            telnetClients[i].client.print(clients);
            
          } else if (command == "wifi") {
            String wifiInfo = "WiFi Information:\r\n";
            wifiInfo += "  SSID: " + String(WiFi.SSID()) + "\r\n";
            wifiInfo += "  IP: " + WiFi.localIP().toString() + "\r\n";
            wifiInfo += "  MAC: " + String(WiFi.macAddress()) + "\r\n";
            wifiInfo += "  RSSI: " + String(WiFi.RSSI()) + " dBm\r\n";
            wifiInfo += "  Channel: " + String(WiFi.channel()) + "\r\n";
            wifiInfo += "> ";
            telnetClients[i].client.print(wifiInfo);
            
          } else if (command == "memory") {
            String memInfo = "Memory Information:\r\n";
            memInfo += "  Free Heap: " + String(ESP.getFreeHeap()) + " bytes\r\n";
            memInfo += "  Min Free Heap: " + String(ESP.getMinFreeHeap()) + " bytes\r\n";
            memInfo += "  Max Alloc Heap: " + String(ESP.getMaxAllocHeap()) + " bytes\r\n";
            memInfo += "  PSRAM Size: " + String(ESP.getPsramSize()) + " bytes\r\n";
            memInfo += "  Free PSRAM: " + String(ESP.getFreePsram()) + " bytes\r\n";
            memInfo += "> ";
            telnetClients[i].client.print(memInfo);
            
          } else if (command == "config") {
            String configInfo = "Current Configuration:\r\n";
            configInfo += "  Device Name: " + config.deviceName + "\r\n";
            configInfo += "  Theme: " + config.theme + "\r\n";
            configInfo += "  OTA Enabled: " + String(config.enableOTA ? "Yes" : "No") + "\r\n";
            configInfo += "  Telnet Enabled: " + String(config.enableTelnet ? "Yes" : "No") + "\r\n";
            configInfo += "  Update Interval: " + String(config.updateInterval) + "ms\r\n";
            configInfo += "  Custom1: " + config.customParam1 + "\r\n";
            configInfo += "  Custom2: " + config.customParam2 + "\r\n";
            configInfo += "  Custom3: " + String(config.customParam3) + "\r\n";
            configInfo += "  Custom4: " + String(config.customParam4) + "\r\n";
            configInfo += "> ";
            telnetClients[i].client.print(configInfo);
            
          } else if (command == "clear" || command == "cls") {
            // Clear screen (ANSI escape codes)
            telnetClients[i].client.print("\033[2J\033[H"); // Clear screen and move to home
            telnetClients[i].client.print("> ");
            
          } else if (command == "disconnect") {
            telnetClients[i].client.print("👋 Disconnecting...\r\n");
            telnetClients[i].client.stop();
            telnetClients[i].connected = false;
            
          } else {
            // Pass command to custom callback if set
            if (telnetCommandCallback != nullptr) {
              telnetCommandCallback(command, telnetClients[i].client);
            } else {
              telnetClients[i].client.print("❌ Unknown command. Type 'help' for available commands.\r\n> ");
            }
          }
        }
      }
      
      // Check for client timeout (10 minutes)
      if (millis() - telnetClients[i].lastActivity > 600000) {
        log("⏰ Telnet client timeout: ");
        logln(telnetClients[i].client.remoteIP().toString());
        telnetClients[i].client.print("⏰ Connection timeout. Goodbye!\r\n");
        telnetClients[i].client.stop();
        telnetClients[i].connected = false;
      }
    } else {
      // Client disconnected
      if (telnetClients[i].connected) {
        log("🔌 Telnet client disconnected: ");
        logln(telnetClients[i].client.remoteIP().toString());
        telnetClients[i].connected = false;
      }
    }
  }
}

