DanAla/ESP32-S3_EasyConnect/src/ESP32-S3_EasyConnect.cpp
void ESP32S3_EasyConnect::broadcastTelnet(String message) {
  if (!config.enableTelnet) return;
  
  for (int i = 0; i < MAX_TELNET_CLIENTS; i++) {
    if (telnetClients[i].connected && telnetClients[i].client.connected()) {
      telnetClients[i].client.print(message);
    }
  }
}

void ESP32S3_EasyConnect::sendToTelnet(String message) {
  if (!config.enableTelnet) return;
  broadcastTelnet(message);
}

// Enhanced logging system
void ESP32S3_EasyConnect::log(String message) {
  Serial.print(message);
  sendToTelnet(message);
}

void ESP32S3_EasyConnect::logln(String message) {
  Serial.println(message);
  sendToTelnet(message + "\r\n");
}

void ESP32S3_EasyConnect::logf(const char* format, ...) {
  char buffer[256];
  va_list args;
  va_start(args, format);
  vsnprintf(buffer, sizeof(buffer), format, args);
  va_end(args);
  
  Serial.print(buffer);
  sendToTelnet(buffer);
}

bool ESP32S3_EasyConnect::loadConfig() {
  File file = LittleFS.open(configFile, "r");
  if (!file) {
    logln("❌ Failed to open config file for reading");
    return false;
  }
  
  size_t size = file.size();
  std::unique_ptr<char[]> buf(new char[size]);
  file.readBytes(buf.get(), size);
  file.close();
  
  DynamicJsonDocument doc(1024);
  DeserializationError error = deserializeJson(doc, buf.get());
  
  if (error) {
    logln("❌ Failed to parse config file");
    return false;
  }
  
  config.deviceName = doc["deviceName"] | "ESP32-S3-Device";
  config.theme = doc["theme"] | "dark";
  config.enableOTA = doc["enableOTA"] | true;
  config.enableTelnet = doc["enableTelnet"] | true;
  config.telnetPort = doc["telnetPort"] | 23;
  config.updateInterval = doc["updateInterval"] | 5000;
  config.customParam1 = doc["customParam1"] | "";
  config.customParam2 = doc["customParam2"] | "";
  config.customParam3 = doc["customParam3"] | 0;
  config.customParam4 = doc["customParam4"] | 0.0;
  
  logln("✅ Configuration loaded successfully");
  return true;
}

bool ESP32S3_EasyConnect::saveConfig() {
  DynamicJsonDocument doc(1024);
  
  doc["deviceName"] = config.deviceName;
  doc["theme"] = config.theme;
  doc["enableOTA"] = config.enableOTA;
  doc["enableTelnet"] = config.enableTelnet;
  doc["telnetPort"] = config.telnetPort;
  doc["updateInterval"] = config.updateInterval;
  doc["customParam1"] = config.customParam1;
  doc["customParam2"] = config.customParam2;
  doc["customParam3"] = config.customParam3;
  doc["customParam4"] = config.customParam4;
  
  File file = LittleFS.open(configFile, "w");
  if (!file) {
    logln("❌ Failed to open config file for writing");
    return false;
  }
  
  serializeJson(doc, file);
  file.close();
  
  logln("✅ Configuration saved successfully");
  return true;
}

void ESP32S3_EasyConnect::setupWebServer() {
  // Serve static files from LittleFS
  server.serveStatic("/", LittleFS, "/").setDefaultFile("index.html");
  
  // REST API endpoints
  server.on("/", HTTP_GET, [this]() { handleRoot(); });
  server.on("/api/status", HTTP_GET, [this]() { handleAPIStatus(); });
  server.on("/api/config", HTTP_GET, [this]() { handleAPIConfig(); });
  server.on("/api/config", HTTP_POST, [this]() { handleAPIConfig(); });
  server.on("/api/system", HTTP_POST, [this]() { handleAPISystem(); });
  server.on("/api/scan", HTTP_GET, [this]() { handleAPIScan(); });
  server.onNotFound([this]() { handleNotFound(); });
}

void ESP32S3_EasyConnect::setupWebSocket() {
  webSocket.begin();
  webSocket.onEvent([this](uint8_t num, WStype_t type, uint8_t* payload, size_t length) {
    this->webSocketEvent(num, type, payload, length);
  });
}

void ESP32S3_EasyConnect::handleRoot() {
  server.send(200, "text/html", 
    "<html>"
    "<head><title>ESP32-S3 EasyConnect</title></head>"
    "<body>"
    "<h1>ESP32-S3 EasyConnect Framework</h1>"
    "<p>Device is running. Access the dashboard at <a href='/index.html'>/index.html</a></p>"
    "<p>OTA Updates: <a href='/update'>/update</a></p>"
    "<p>API Status: <a href='/api/status'>/api/status</a></p>"
    "</body>"
    "</html>");
}

void ESP32S3_EasyConnect::handleAPIStatus() {
  DynamicJsonDocument doc(512);
  
  doc["device"]["name"] = config.deviceName;
  doc["device"]["chipId"] = String((uint32_t)ESP.getEfuseMac(), HEX);
  doc["device"]["flashSize"] = ESP.getFlashChipSize();
  doc["device"]["freeHeap"] = ESP.getFreeHeap();
  doc["device"]["sdkVersion"] = ESP.getSdkVersion();
  doc["device"]["uptime"] = deviceUptime;
  
  doc["wifi"]["connected"] = isWiFiConnected();
  doc["wifi"]["ssid"] = WiFi.SSID();
  doc["wifi"]["rssi"] = WiFi.RSSI();
  doc["wifi"]["ip"] = WiFi.localIP().toString();
  doc["wifi"]["mac"] = WiFi.macAddress();
  
  doc["system"]["uptime"] = deviceUptime;
  doc["system"]["restartReason"] = ESP.getResetReason();
  doc["system"]["telnetEnabled"] = config.enableTelnet;
  doc["system"]["telnetClients"] = getTelnetClientCount();
  
  // Add custom data if callback is set
  if (customDataCallback != nullptr) {
    customDataCallback(doc);
  }
  
  String response;
  serializeJson(doc, response);
  server.send(200, "application/json", response);
}

void ESP32S3_EasyConnect::handleAPIConfig() {
  if (server.method() == HTTP_GET) {
    DynamicJsonDocument doc(1024);
    
    doc["deviceName"] = config.deviceName;
    doc["theme"] = config.theme;
    doc["enableOTA"] = config.enableOTA;
    doc["enableTelnet"] = config.enableTelnet;
    doc["telnetPort"] = config.telnetPort;
    doc["updateInterval"] = config.updateInterval;
    doc["customParam1"] = config.customParam1;
    doc["customParam2"] = config.customParam2;
    doc["customParam3"] = config.customParam3;
    doc["customParam4"] = config.customParam4;
    
    String response;
    serializeJson(doc, response);
    server.send(200, "application/json", response);
    
  } else if (server.method() == HTTP_POST) {
    String body = server.arg("plain");
    DynamicJsonDocument doc(1024);
    DeserializationError error = deserializeJson(doc, body);
    
    if (error) {
      server.send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
      return;
    }
    
    if (doc.containsKey("deviceName")) config.deviceName = doc["deviceName"].as<String>();
    if (doc.containsKey("theme")) config.theme = doc["theme"].as<String>();
    if (doc.containsKey("enableOTA")) config.enableOTA = doc["enableOTA"];
    if (doc.containsKey("enableTelnet")) config.enableTelnet = doc["enableTelnet"];
    if (doc.containsKey("telnetPort")) config.telnetPort = doc["telnetPort"];
    if (doc.containsKey("updateInterval")) config.updateInterval = doc["updateInterval"];
    if (doc.containsKey("customParam1")) config.customParam1 = doc["customParam1"].as<String>();
    if (doc.containsKey("customParam2")) config.customParam2 = doc["customParam2"].as<String>();
    if (doc.containsKey("customParam3")) config.customParam3 = doc["customParam3"];
    if (doc.containsKey("customParam4")) config.customParam4 = doc["customParam4"];
    
