DanAla/ESP32-S3_EasyConnect/src/ESP32-S3_EasyConnect.cpp
    saveConfig();
    
    if (onConfigChangedCallback != nullptr) {
      onConfigChangedCallback();
    }
    
    server.send(200, "application/json", "{\"status\":\"Configuration updated\"}");
  }
}

void ESP32S3_EasyConnect::handleAPISystem() {
  String action = server.arg("action");
  
  if (action == "restart") {
    server.send(200, "application/json", "{\"status\":\"Restarting...\"}");
    delay(1000);
    restartDevice();
  } else if (action == "factoryReset") {
    server.send(200, "application/json", "{\"status\":\"Factory reset...\"}");
    delay(1000);
    factoryReset();
  } else {
    server.send(400, "application/json", "{\"error\":\"Invalid action\"}");
  }
}

void ESP32S3_EasyConnect::handleAPIScan() {
  int n = WiFi.scanNetworks();
  DynamicJsonDocument doc(2048);
  JsonArray networks = doc.createNestedArray("networks");
  
  for (int i = 0; i < n; ++i) {
    JsonObject network = networks.createNestedObject();
    network["ssid"] = WiFi.SSID(i);
    network["rssi"] = WiFi.RSSI(i);
    network["encryption"] = (WiFi.encryptionType(i) == WIFI_AUTH_OPEN) ? "open" : "secured";
    network["channel"] = WiFi.channel(i);
  }
  
  String response;
  serializeJson(doc, response);
  server.send(200, "application/json", response);
}

void ESP32S3_EasyConnect::handleNotFound() {
  server.send(404, "application/json", "{\"error\":\"Endpoint not found\"}");
}

void ESP32S3_EasyConnect::webSocketEvent(uint8_t num, WStype_t type, uint8_t* payload, size_t length) {
  switch (type) {
    case WStype_DISCONNECTED:
      logf("[%u] WebSocket Disconnected!\n", num);
      break;
    case WStype_CONNECTED:
      {
        IPAddress ip = webSocket.remoteIP(num);
        logf("[%u] WebSocket Connected from %d.%d.%d.%d\n", num, ip[0], ip[1], ip[2], ip[3]);
        sendDeviceStatus();
      }
      break;
    case WStype_TEXT:
      {
        String message = String((char*)payload);
        logf("[%u] WebSocket Received: %s\n", num, message.c_str());
        
        // Handle WebSocket commands
        if (message == "getStatus") {
          sendDeviceStatus();
        } else if (message == "toggleTheme") {
          config.theme = (config.theme == "dark") ? "light" : "dark";
          saveConfig();
          sendDeviceStatus();
        } else {
          // Pass to custom callback
          if (webSocketCommandCallback != nullptr) {
            webSocketCommandCallback(message, num);
          }
        }
      }
      break;
  }
}

void ESP32S3_EasyConnect::sendDeviceStatus() {
  DynamicJsonDocument doc(512);
  
  doc["type"] = "status";
  doc["wifi"]["connected"] = isWiFiConnected();
  doc["wifi"]["ssid"] = WiFi.SSID();
  doc["wifi"]["rssi"] = WiFi.RSSI();
  doc["wifi"]["ip"] = WiFi.localIP().toString();
  doc["system"]["freeHeap"] = ESP.getFreeHeap();
  doc["system"]["uptime"] = deviceUptime;
  doc["config"]["theme"] = config.theme;
  doc["config"]["deviceName"] = config.deviceName;
  doc["telnet"]["enabled"] = config.enableTelnet;
  doc["telnet"]["clients"] = getTelnetClientCount();
  
  String jsonString;
  serializeJson(doc, jsonString);
  webSocket.broadcastTXT(jsonString);
}

void ESP32S3_EasyConnect::broadcastWebSocket(String message) {
  webSocket.broadcastTXT(message);
}

void ESP32S3_EasyConnect::restartDevice() {
  logln("🔄 Restarting device...");
  delay(1000);
  ESP.restart();
}

void ESP32S3_EasyConnect::factoryReset() {
  logln("🗑️ Performing factory reset...");
  
  // Clear WiFi credentials
  wifiManager.resetSettings();
  
  // Delete config file
  LittleFS.remove(configFile);
  
  // Disconnect all telnet clients
  disconnectTelnetClients();
  
  delay(1000);
  ESP.restart();
}

bool ESP32S3_EasyConnect::isWiFiConnected() {
  return WiFi.status() == WL_CONNECTED;
}

// Callback setters
void ESP32S3_EasyConnect::onConnected(void (*callback)()) {
  onConnectedCallback = callback;
}

void ESP32S3_EasyConnect::onDisconnected(void (*callback)()) {
  onDisconnectedCallback = callback;
}

void ESP32S3_EasyConnect::onConfigChanged(void (*callback)()) {
  onConfigChangedCallback = callback;
}

void ESP32S3_EasyConnect::setCustomDataCallback(void (*callback)(JsonDocument&)) {
  customDataCallback = callback;
}

void ESP32S3_EasyConnect::onTelnetCommand(void (*callback)(String, WiFiClient&)) {
  telnetCommandCallback = callback;
}

void ESP32S3_EasyConnect::onWebSocketCommand(void (*callback)(String, uint8_t)) {
  webSocketCommandCallback = callback;
}

int ESP32S3_EasyConnect::getTelnetClientCount() {
  int count = 0;
  for (int i = 0; i < MAX_TELNET_CLIENTS; i++) {
    if (telnetClients[i].connected && telnetClients[i].client.connected()) {
      count++;
    }
  }
  return count;
}

void ESP32S3_EasyConnect::disconnectTelnetClients() {
  for (int i = 0; i < MAX_TELNET_CLIENTS; i++) {
    if (telnetClients[i].connected) {
      telnetClients[i].client.print("🔌 Server shutting down for maintenance. Goodbye!\r\n");
      telnetClients[i].client.stop();
      telnetClients[i].connected = false;
    }
  }
}

void ESP32S3_EasyConnect::printDebugInfo() {
  logln("\n=== ESP32-S3 EasyConnect Debug Info ===");
  log("Device Name: "); logln(config.deviceName);
  log("WiFi Status: "); logln(isWiFiConnected() ? "Connected" : "Disconnected");
  log("IP Address: "); logln(WiFi.localIP().toString());
  log("Free Heap: "); logln(String(ESP.getFreeHeap()) + " bytes");
  log("Theme: "); logln(config.theme);
  log("Telnet Enabled: "); logln(config.enableTelnet ? "Yes" : "No");
  log("Telnet Clients: "); logln(String(getTelnetClientCount()) + "/" + String(MAX_TELNET_CLIENTS));
  log("Uptime: "); logln(String(deviceUptime / 1000) + " seconds");
  logln("====================================\n");
}

String ESP32S3_EasyConnect::getIPAddress() {
  return WiFi.localIP().toString();
}

unsigned long ESP32S3_EasyConnect::getUptime() {
  return deviceUptime;
}

DeviceConfig ESP32S3_EasyConnect::getConfig() {
  return config;
}

void ESP32S3_EasyConnect::setConfig(const DeviceConfig& newConfig) {
  config = newConfig;
  saveConfig();
}
